{/* Task 1. Треугольник.
 */

// let cell = '';
// for (let index = 0; index < 8; index += 1) {
//     cell += '#';    
//     console.log(cell);
//     }
}
{   /*  Task 2. FizzBuzz. 
    * Вывести в консоль все числа от 1 до 100
    * Для чисел, нацело делящихся на 3, выводить ‘Fizz’,
    * Для чисел, нацело делящихся на 5  – ‘Buzz’ 
    * Добавить условие для чисел, нацело делящихся на 5, не на 3.
    * Исправьте её так, чтобы она выводила «FizzBuzz» для всех чисел, которые делятся и на 3 и на 5.
*/
    // let fizzBuzz = [];
    // for (let i = 1; i <= 100; i += 1) {
    //     if (!(i % 3) && !(i % 5)) {
    //         fizzBuzz.push('FizzBuzz');
    //     } else if (!(i % 3)) {
    //         fizzBuzz.push('Fizz');
    //     } else if (!(i % 5)) {
    //         fizzBuzz.push('Buzz');
    //     }
    //     else {
    //         fizzBuzz.push(i);}
            
            
            
    //     }
    //     console.log(fizzBuzz);

}
{
/* Task 3. Шахматная доска.
    * Напишите программу, создающую строку, содержащую решётку 8х8,
    * в которой линии разделяются символами новой строки.
    * На каждой позиции либо пробел, либо #.
    * В результате должна получиться шахматная доска.
1# # # #
2 # # # #
3# # # #
4 # # # #
5# # # #
6 # # # #
7# # # #
8 # # # #
*/

}
{/* Task 4. Минимум. 
    * Напишите функцию min, принимающую два аргумента,
    * и возвращающую минимальный из них.
1 console.log(min(0, 10));
2 // → 0
3 console.log(min(0, -10));
4 // → -10
*/

}
{/* Task. .
    *
*/

}
{/* Task. .
    *
*/

}
{/* Task. .
    *
*/

}